Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: If you search for "ter.", you will find these matches:
es_es: Si busca «an.», obtendría las siguientes coincidencias:

source: When you make a jump to a position with the "G" command, Vim remembers the position from before this jump.
es_es: Cuando hace un salto a una posición con la orden «G», Vim recuerda la posición antes de el salto.

source: This position is called a mark.
es_es: Esta posición se llama marca o marcador.

source: To go back where you came from, use this command: >
es_es: Para volver al punto anterior del que te encuentras, use la siguiente orden: >

source: This ` is a backtick or open single-quote character.
es_es: Esta ` es una tilde invertida o carácter de abrir comillas simples.

source: If you use the same command a second time you will jump back again.
es_es: Si usa esta misma orden de nuevo, volverá hacia atrás.

source: That's because the ` command is a jump itself, and the position from before this jump is remembered.
es_es: Esto es porque la orden «`» es un salto en si mismo, y la posición anterior al salto también se registra.

source: The `` command jumps back and forth, between two points.
es_es: La orden «``» salta hacia atrás y hacia delante, entre dos puntos.

source: The CTRL-O command jumps to older positions (Hint: O for older).
es_es: La orden CTRL-O salta a posiciones anteriores (Truco: O de «older», viejo).

source: CTRL-I then jumps back to newer positions (Hint: I is just next to O on the keyboard).
es_es: CTRL-I salta de vuelta a posiciones más recientes (Truco: la I está justo al lado de la O en el teclado).

source: Consider this sequence of commands: >
es_es: Observe esta secuencia de órdenes: >

source: You first jump to line 33, then search for a line that starts with "The".
es_es: Primero salta a la línea 33, luego salta a una línea que comienza con «El».

source: Then with CTRL-O you jump back to line 33.
es_es: Entonces vuelva con CTRL-O a la línea 33.

source: Another CTRL-O takes you back to where you started.
es_es: Otro CTRL-O le devuelve a donde comenzó.

source: If you now use CTRL-I you jump to line 33 again.
es_es: Si ahora usa CTRL-I, volverá a la línea 33.

source: And to the match for "The" with another CTRL-I.
es_es: Con otro CTRL-I vuelve al «El» identificado.

source: The ":jumps" command gives a list of positions you jumped to.
es_es: La orden «:jumps» le da una lista de posiciones a las que ha saltado.

source: The entry which you used last is marked with a ">".
es_es: La última entrada que ha usado está marcada con un «>».

source: Vim enables you to place your own marks in the text.
es_es: Vim le permite colocar sus propias marcas en el texto.

source: The command "ma" marks the place under the cursor as mark a.
es_es: La orden «m» marca el lugar sobre el que se encuentra el cursor como «a».

source: You can place 26 marks (a through z) in your text.
es_es: Puede poner hasta 26 marcas (a-z).

source: You can't see them, it's just a position that Vim remembers.
es_es: No puede verlas, son simplemente posiciones que Vim recuerda.

source: To go to a mark, use the command `{mark}, where {mark} is the mark letter.
es_es: Para ir a una marca, use la orden `{marca}, donde {marca} es la letra del marcador.

source: Thus to move to the a mark: > `a
es_es: Para moverse a la marca «a»: > `a

source: The command 'mark (single quotation mark, or apostrophe) moves you to the beginning of the line containing the mark.
es_es: La orden '{marca} (apóstrofe o signo de comillas simples) le lleva al comienzo de la línea que contiene la marca.

source: This differs from the `mark command, which moves you to marked column.
es_es: Esto difiere de la orden `{marca}, que le desplaza a la columna donde se hizo la marca.

source: The marks can be very useful when working on two related parts in a file.
es_es: Los marcadores pueden ser muy útiles cuando se trabaja en dos partes del archivo relacionadas.

source: Suppose you have some text near the start of the file you need to look at, while working on some text near the end of the file.
es_es: Suponga que tiene un texto cerca del comienzo del archivo que necesitas mirar mientras trabaja en otra parte.

source: Move to the text at the start and place the s (start) mark there: >
es_es: Vaya al texto del comienzo y ponga un marcador «s» (start) allí: >

source: Then you can use '' to jump back to where you were, or 'e to jump to the text you were working on at the end.
es_es: Luego puede usar '' para saltar de vuelta a donde estaba, o 'e para saltar al texto donde estuvo trabajando.

source: There is nothing special about using s for start and e for end, they are just easy to remember.
es_es: No hay nada especial en usar s para el comienzo o e para el final, son simplemente fáciles de recordar.

source: You will notice a few special marks.
es_es: Verá unos cuantos marcadores especiales.

source: These include:
es_es: Entre ellos:

source: *usr_27.txt* For Vim version 7.3.
es_es: *usr_27.esx* Para Vim version 7.3.

source: Last change: 2010 Mar 28
es_es: Último cambio: 28/3/2010

source: By default, Vim's searches are case sensitive.
es_es: Vim distingue entre mayúsculas y minúsculas al realizar un búsqueda de forma predeterminada.

source: Therefore, "include", "INCLUDE", and "Include" are three different words and a search will match only one of them.
es_es: «INCLUDE», «Include» e «include» son por ello tres palabras distintas, y una búsqueda encontraría sólo una de ellas.

source: Now switch on the 'ignorecase' option: >
es_es: Active ahora la opción 'ignorecase': >

source: But let's keep it set, and search for "INCLUDE".
es_es: Vamos a dejar esta opción activada, y realizar una búsqueda de «INCLUDE».

source: It will match exactly the same text as "include" did.
es_es: Encontrará el mismo texto que «include».

source: Now set the 'smartcase' option: >
es_es: Active ahora la opción 'smartcase': >

source: If you have a pattern with at least one uppercase character, the search becomes case sensitive.
es_es: Si tiene un patrón con al menos un carácter en mayúscula, la búsqueda no distinguirá entre mayúsculas y minúsculas.

source: The idea is that you didn't have to type that uppercase character, so you must have done it because you wanted case to match.
es_es: La idea es que no necesitaba escribir ese carácter en mayúscula, y que por ello lo que deseaba era encontrar coincidencias con distinción entre mayúsculas y minúsculas.

source: That's smart!
es_es: ¡Qué inteligente!

source: With these two options set you find the following matches:
es_es: Obtendría las siguientes coincidencias de activar ambas opciones:

source: pattern matches ~ word word, Word, WORD, WoRd, etc.
es_es: patrón coincidencias ~ palabra palabra, Palabra, PALABRA, PaLaBRa etc.

source: Word Word WORD WORD WoRd WoRd
es_es: Palabra Palabra PALABRA PALABRA PaLaBRa PaLaBRa

source: If you want to ignore case for one specific pattern, you can do this by prepending the "\c" string.
es_es: Puede anexar la cadena «\c» si desea ignorar esta distinción para un patrón en particular.

source: Using "\C" will make the pattern to match case.
es_es: Usar «\C» activará la distinción.

source: This overrules the 'ignorecase' and 'smartcase' options, when "\c" or "\C" is used their value doesn't matter.
es_es: Esto invalida las opciones 'ignorecase' y 'smartcase', ya que usar «\c» o «\C» obvia el valor de estas opciones.

source: pattern matches ~ \Cword word \CWord Word \cword word, Word, WORD, WoRd, etc.
es_es: patrón coincidencias ~ \Cpalabra palabra \CPalabra Palabra \cpalabra palabra, Palabra, PALABRA, PaLaBrA, etc.

source: \cWord word, Word, WORD, WoRd, etc.
es_es: \cPalabra palabra, Palabra, PALABRA, PaLaBrA, etc.

source: A big advantage of using "\c" and "\C" is that it sticks with the pattern.
es_es: Una enorme ventaja de usar «\c» y «\C» es que se mantienen ligadas al patrón.

source: Thus if you repeat a pattern from the search history, the same will happen, no matter if 'ignorecase' or 'smartcase' was changed.
es_es: Por ello, si repite un patrón desde el registro de búsquedas obtendrá el mismo resultado sin importar si cualquier cambio de 'ignorecase' y 'smartcase'.

source: Note: The use of "\" items in search patterns depends on the 'magic' option.
es_es: Nota: El uso del elemento «\» en patrones de búsqueda depende de la opción 'magic'.

source: In this chapter we will assume 'magic' is on, because that is the standard and recommended setting.
es_es: En estos capítulos daremos por sentado que 'magic' está activado, ya que es la configuración estándar y recomendad.

source: If you would change 'magic', many search patterns would suddenly become invalid.
es_es: De cambiar 'magic' muchos patrones de búsqueda no serían válidos.

source: By default, a forward search starts searching for the given string at the current cursor location.
es_es: Por omisión, una búsqueda hacia adelante se inicia buscando la cadena dada en la ubicación presente del cursor.

source: It then proceeds to the end of the file.
es_es: Después continua hasta el final del archivo.

source: If it has not found the string by that time, it starts from the beginning and searches from the start of the file to the cursor location.
es_es: Si no ha encontrado ninguna cadena, vuelve al inicio y busca desde el principio del archivo.

source: Keep in mind that when repeating the "n" command to search for the next match, you eventually get back to the first match.
es_es: Tenga en cuenta que, de repetir la orden «n» para buscar la siguiente coincidencia, al final volverá a la primera.

source: If you don't notice this you keep searching forever!
es_es: ¡Buscará para siempre si no nota esto!

source: To give you a hint, Vim displays this message:
es_es: Vim le da una pista con la forma del siguiente mensaje:

source: Still, you don't know when you are back at the first match.
es_es: Aún así,no sabe cuando vuelve a la primera coincidencia.

source: One way to see this is by switching on the 'ruler' option: >
es_es: Una forma de ver esto es activando la opción 'ruler'.

source: Vim will display the cursor position in the lower righthand corner of the window (in the status line if there is one).
es_es: Muestra siempre la posición actual en la esquina inferior derecha de la ventana (en la línea de estado, de existir).

source: The first number is the line number of the cursor.
es_es: El primer número es el número de la línea del cursor.

source: Remember the line number where you started, so that you can check if you passed this position again.
es_es: Recuerde el número de la línea inicial, de manera pueda comprobar si ya pasó por esta posición.

source: Thus you can find all matches by going to the start of the file with "gg" and keep searching until you see this message.
es_es: Así, puede encontrar todas las coincidencias desplazándose al inicio del archivo con «gg», y buscar hasta ver este mensaje.

source: If you search in the other direction, using "?", you get:
es_es: Si busca en otra dirección, usando, «?», obtendrá:

source: By default, the search command leaves the cursor positioned on the beginning of the pattern.
es_es: Por omisión, la orden de búsqueda posiciona el cursor al inicio del patrón.

source: You can tell Vim to leave it some other place by specifying an offset.
es_es: Puede hacer que Vim lo posicione en algún lugar especificando una dirección relativa.

source: For the forward search command "/", the offset is specified by appending a slash (/) and the offset: >
es_es: Para la orden de búsqueda hacia delante «/», la dirección relativa se especifica añadiendo una barra inversa («/») y la dirección relativa: >

source: This command searches for the pattern "default" and then moves to the beginning of the second line past the pattern.
es_es: Esta orden busca el patrón «omisión», y después se desplaza al inicio de la segunda línea, más allá del patrón.

source: Using this command on the paragraph above, Vim finds the word "default" in the first line.
es_es: De usar esta orden en el párrafo anterior, Vim encontraría la palabra «omisión» en la primera línea.

source: Then the cursor is moved two lines down and lands on "an offset".
es_es: Acto seguido, el cursor se posicionaría dos líneas más abajo, para acabar en la dirección relativa.

source: If the offset is a simple number, the cursor will be placed at the beginning of the line that many lines from the match.
es_es: El cursor se posicionara al inicio de la línea presente un número n de líneas a partir de la coincidencia, si la dirección relativa es un simple número.

source: The offset number can be positive or negative.
es_es: El número de dirección relativa puede ser positivo o negativo.

source: If it is positive, the cursor moves down that many lines; if negative, it moves up.
es_es: De ser positivo, el cursor se desplaza hacia abajo un número n de líneas; si es negativo, se desplaza hacia arriba.

source: The "e" offset indicates an offset from the end of the match.
es_es: La dirección relativa «e» indica una dirección a partir del final de la coincidencia.

source: It moves the cursor onto the last character of the match.
es_es: Desplaza el cursor al último carácter de la coincidencia.

source: puts the cursor on the "t" of "const".
es_es: pone el cursor sobre la «t» de «const».

source: From that position, adding a number moves forward that many characters.
es_es: Añadir un número le desplazará hacia delante tantos caracteres desde la posición inicial.

source: This command moves to the character just after the match: >
es_es: Esta orden desplaza el carácter a la posición anterior a la coincidencia: >

source: A positive number moves the cursor to the right, a negative number moves it to the left.
es_es: Un número positivo desplaza el cursor a la derecha, un número negativo lo desplaza a la izquierda.

source: If the offset begins with "b", the cursor moves to the beginning of the pattern.
es_es: Si la dirección empieza con una «b», el cursor se desplazará al inicio del patrón.

source: That's not very useful, since leaving out the "b" does the same thing.
es_es: No es muy útil, ya que se logra lo mismo dejando la «b».

source: It does get useful when a number is added or subtracted.
es_es: Es de utilidad al añadir o sustraer un número.

source: The cursor then goes forward or backward that many characters.
es_es: Entonces, el cursor se desplaza hacia delante o atrás tantos caracteres.

source: Moves the cursor to the beginning of the match and then two characters to the right.
es_es: Desplaza el cursor al principio de la coincidencia, dos caracteres a la derecha.

source: Thus it lands on the "n".
es_es: Por ello, finaliza en «n».

source: "n" does the same thing.
es_es: «n» hace lo mismo.

source: To repeat while removing a previously used offset: >
es_es: Para repetir mientras elimina una dirección usada anteriormente: >

source: When starting a search, it normally starts at the cursor position.
es_es: Al iniciar una búsqueda, generalmente comienza por la posición del cursor.

source: When you specify a line offset, this can cause trouble.
es_es: Esto puede causar problemas cuando especifica un desplazamiento relativo de línea.

source: This finds the next word "const" and then moves two lines up.
es_es: Esto encuentra la siguiente aparición de «const», y después se desplaza dos líneas haci arriba.

source: If you use "n" to search again, Vim could start at the current position and find the same "const" match.
es_es: Si usa «n» para repetir la búsqueda, puede que Vim la inicie en la posición actual, encontrando la misma coincidencia de «const».

source: Then using the offset again, you would be back where you started.
es_es: Al usar el mismo desplazamiento relativo, ha vuelto al punto inicio.

source: You would be stuck!
es_es: ¡Se quedaría atascado!

source: It could be worse: Suppose there is another match with "const" in the next line.
es_es: Aún pero: supongo que existe otra aparición de «const» en la siguiente línea.

source: Then repeating the forward search would find this match and move two lines up.
es_es: Repetir la búsqueda hacia adelante encontraría esta coincidencia, y desplazaría el cursor dos líneas atrás.

source: Thus you would actually move the cursor back!
es_es: ¡Estaría desplazando el cursor hacia atrás todo el rato!

source: When you specify a character offset, Vim will compensate for this.
es_es: Al especificar un carácter de desplazamiento relativo, Vim dará una compensación.

source: Thus the search starts a few characters forward or backward, so that the same match isn't found again.
es_es: Por ello, la búsqueda se inicia unos cuantos caracteres delante o detrás, para no encontrar otra vez la misma coincidencia.

source: The "*" item specifies that the item before it can match any number of times.
es_es: El elemento «*» especifica que el elemento precedente puede emparejarse un número ilimitado de veces.

source: Thus: >
es_es: Por ello: >

source: matches "a", "aa", "aaa", etc.
es_es: coincide con «a», «aa», «aaa», etc.

source: But also "" (the empty string), because zero times is included.
es_es: Pero también « » (una cadena vacía), ya que se incluye por omisión cero veces.

source: The "*" only applies to the item directly before it.
es_es: «*» sólo afecta al su elemento precedente.

source: Thus "ab*" matches "a", "ab", "abb", "abbb", etc.
es_es: Por ello, «ab*» encuentra «a», «ab», «abb», «abbb», etc.

source: To match a whole string multiple times, it must be grouped into one item.
es_es: Para encontrar varias apariciones de una cadena completa, ésta ha de estar agrupada bajo un mismo elemento.

source: This is done by putting "\(" before it and "\)" after it.
es_es: Esto se hace colocando «\(» antes de la cadena, y «\)» después.

source: Thus this command: >
es_es: Por ello, la siguiente orden: >

source: Matches: "ab", "abab", "ababab", etc.
es_es: encuentra «ab», «abab», «ababab», etc.

source: And also "".
es_es: También « ».

source: To avoid matching the empty string, use "\+".
es_es: Para evitar que coincida con una cadena vacía, use «\+».

source: This makes the previous item match one or more times.
es_es: Esto encuentra una o más apariciones del elemento precedente.

source: Matches "ab", "abb", "abbb", etc.
es_es: Encuentra «ab», «abb», «abbb», etc.

source: It does not match "a" when no "b" follows.
es_es: No coincide con «a» si no va seguido de «b».

source: To match an optional item, use "\=".
es_es: Para hacer coincidir un elemento opcional, utilice «\=».

source: To match a specific number of items use the form "\{n,m}".
es_es: Use la forma «\{n,m}» para emparejar un número específico de elementos.

source: "n" and "m" are numbers.
es_es: «n» y «m» son números.

source: The item before it will be matched "n" to "m" times |inclusive|.
es_es: El elemento anterior a éstos se emparejará con «n» un número «m» de veces |inclusive|.

source: matches "abbb", "abbbb" and "abbbbb".
es_es: empareja «abbb», «abbbb» y «abbbbb».

source: When "n" is omitted, it defaults to zero.
es_es: El valor predeterminado cero en ausencia de «n».

source: When "m" is omitted it defaults to infinity.
es_es: El valor predeterminado es infinito en ausencia de «m».

source: When ",m" is omitted, it matches exactly "n" times.
es_es: En ausencia de «m», se empareja exactamente «n» veces.

source: Examples:
es_es: Ejemplos:

source: pattern match count ~ \{,4} 0, 1, 2, 3 or 4 \{3,} 3, 4, 5, etc.
es_es: patrón número de coincidencias ~ \{,4} 0, 1, 2, 3 o 4 \{3,} 3, 4, 5, etc.

source: \{0,1} 0 or 1, same as \= \{0,} 0 or more, same as * \{1,} 1 or more, same as \+ \{3} 3
es_es: \{0,1} 0 o 1, igual que \= \{0,} 0 o más, igual que * \{1,} 1 o más, igual que \+ \{3} 3

source: Will match "ab" in "abbb".
es_es: Encontraría «ab» en «abbb».

source: Actually, it will never match more than one b, because there is no reason to match more.
es_es: En realidad, nunca coincidirá con mas de una «b», ya que no hay razón para coincidir con más.

source: It requires something else to force it to match more than the lower limit.
es_es: Se precisa algo más para forzar un número de coincidencias mayor que el límite más bajo.

source: The same rules apply to removing "n" and "m".
es_es: Las mismas reglas están presentes al eliminar «n» y «m».

source: It's even possible to remove both of the numbers, resulting in "\{-}".
es_es: También es posible eliminar ambos números, dejando «\{-}».

source: This matches the item before it zero or more times, as few as possible.
es_es: Esto encuentra el elemento anterior a él cero o más veces, pero cuantas menos posibles.

source: The item by itself always matches zero times.
es_es: El elemento en sí siempre se empareja cero veces.

source: It is useful when combined with something else.
es_es: Es de utilidad en combinación con algo más.

source: This matches "axb" in "axbxb".
es_es: Esto coincide con «axb» en «axbxb».

source: If this pattern would be used: >
es_es: De usar este patrón >

source: The "or" operator in a pattern is "\|".
es_es: El operador «or» dentro de un patrón es «\|».

source: This matches "foo" or "bar".
es_es: Esto encuentra «foo» o «bar».

source: More alternatives can be concatenated: >
es_es: Puede concatenar más alternativas: >

source: Matches "one", "two" and "three".
es_es: Coincide con «uno», «dos» y «tres».

source: To match multiple times, the whole thing must be placed in "\(" and "\)": >
es_es: Para encontrar varias coincidencias debe insertar la cadena completa entre «\(» y «\)»: >

source: This matches "foo", "foobar", "foofoo", "barfoobar", etc.
es_es: Esto encuentra «foo», «foobar», «foofoo», «barfoobar», etc.

source: A related item is "\&".
es_es: Un elemento relacionado es «\&».

source: This requires that both alternatives match in the same place.
es_es: Esto requiere que ambas alternativas coincidan en el mismo lugar.

source: The resulting match uses the last alternative.
es_es: La coincidencia resultante usa la última alternativa.

source: This matches "for" in "forever".
es_es: Esto coincide on «for» en «forever».

source: It will not match "fortuin", for example.
es_es: No coincide con «fortuin», por ejemplo.

source: To match "a", "b" or "c" you could use "/a\|b\|c".
es_es: Puede usar «/a|b\|c» para encontrar «a», «b» o «c».

source: When you want to match all letters from "a" to "z" this gets very long.
es_es: Esto se extiende si desea encontrar todas las letras de la «a» a la «z».

source: There is a shorter method: >
es_es: Existe una manera más corta: >

source: The [] construct matches a single character.
es_es: La construcción [] encuentra un sólo carácter.

source: Inside you specify which characters to match.
es_es: Especifique dentro de este los caracteres a encontrar.

source: You can include a list of characters, like this: >
es_es: Puede incluir una lista larga de caracteres, como esto: >

source: This will match any of the characters included.
es_es: Esto encuentra cualquier carácter incluido.

source: For consecutive characters you can specify the range.
es_es: Puede especificar un rango para encontrar caracteres consecutivos.

source: "0-3" stands for "0123".
es_es: «0-3» significa «01234».

source: "w-z" stands for "wxyz".
es_es: «w-z» significa «wxyz».

source: Thus the same command as above can be shortened to: >
es_es: Por ello, puede acortar la orden anterior: >

source: To match the "-" character itself make it the first or last one in the range.
es_es: Para encontrar el carácter «-», tiene que aparecer al principio o final del rango.
